set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

current_design Conv2Ch2x2_SystolicArray_Top

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_false_path -from [get_ports reset]
set_clock_gating_check -setup 0.0
set_input_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports start]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_3[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_4[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_5[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_6[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {aligned_out_7[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports aligned_valid]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports inference_done]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_read_addr[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_read_addr[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_read_addr[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_read_addr[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_read_addr[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_im2col_data[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_im2col_data[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_im2col_data[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_im2col_data[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_im2col_data[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_im2col_data[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_im2col_data[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports {dbg_im2col_data[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports dbg_im2col_valid]
set_output_delay -clock [get_clocks clk] -add_delay 2.0 [get_ports dbg_launch_pulse]
set_wire_load_mode "enclosed"
